arduino/arduino-cli/internal/integrationtest/testdata/platform_with_missing_custom_board_options/boards.txt
nessuno.name=Arduino Nessuno
nessuno.vid.0=0x2341
nessuno.pid.0=0x0043
nessuno.vid.1=0x2341
nessuno.pid.1=0x0001
nessuno.vid.2=0x2A03
nessuno.pid.2=0x0043
nessuno.vid.3=0x2341
nessuno.pid.3=0x0243
nessuno.upload.tool=avrdude
nessuno.upload.protocol=arduino
nessuno.upload.maximum_size=32256
nessuno.upload.maximum_data_size=2048
nessuno.upload.speed=115200
nessuno.bootloader.tool=avrdude
nessuno.bootloader.low_fuses=0xFF
nessuno.bootloader.high_fuses=0xDE
nessuno.bootloader.extended_fuses=0xFD
nessuno.bootloader.unlock_bits=0x3F
nessuno.bootloader.lock_bits=0x0F
nessuno.bootloader.file=optiboot/optiboot_atmega328.hex
nessuno.build.mcu=atmega328p
nessuno.build.f_cpu=16000000L
nessuno.build.board=AVR_NESSUNO
nessuno.build.core=arduino
nessuno.build.variant=standard

nessuno.menu.cache.on=Enabled
nessuno.menu.cache.on.build.cache_flags=-DENABLE_CACHE
nessuno.menu.cache.off=Disabled
nessuno.menu.cache.off.build.cache_flags=

altra.name=Arduino Altra
altra.vid.0=0x2341
altra.pid.0=0x0043
altra.vid.1=0x2341
altra.pid.1=0x0001
altra.vid.2=0x2A03
altra.pid.2=0x0043
altra.vid.3=0x2341
altra.pid.3=0x0243
altra.upload.tool=avrdude
altra.upload.protocol=arduino
altra.upload.maximum_size=32256
altra.upload.maximum_data_size=2048
altra.upload.speed=115200
altra.bootloader.tool=avrdude
altra.bootloader.low_fuses=0xFF
altra.bootloader.high_fuses=0xDE
altra.bootloader.extended_fuses=0xFD
altra.bootloader.unlock_bits=0x3F
altra.bootloader.lock_bits=0x0F
altra.bootloader.file=optiboot/optiboot_atmega328.hex
altra.build.mcu=atmega328p
altra.build.f_cpu=16000000L
altra.build.board=AVR_ALTRA
altra.build.core=arduino
altra.build.variant=standard
